danielac32/stm32/kernel (copia)/beremetal-core/include/main.h
    1 * RCC_PLLCFGR_PLLSRC_HSE       | /*  0x00400000                                            */
    0 * RCC_PLLCFGR_PLLSRC_HSI       | /*                                                        */
                                                                                                 /*
       PLLQ: Main PLL (PLL) division factor for USB OTG FS, SDIO and RNG clocks                  
       ================================================================================          */

    0 * RCC_PLLCFGR_PLLQ             | /*  0x0F000000                                            */
    0 * RCC_PLLCFGR_PLLQ_0           | /*    0x01000000                                          */
    0 * RCC_PLLCFGR_PLLQ_1           | /*    0x02000000                                          */
    0 * RCC_PLLCFGR_PLLQ_2           | /*    0x04000000                                          */
    0 * RCC_PLLCFGR_PLLQ_3             /*    0x08000000                                          */
  );

  RCC->CR = (
    RCC_CR_HSEON                     | /*  Switch HSE ON                                         */
    RCC_CR_PLLON                       /*  Switch PLL ON                                         */
  );                                                                                             /*

    After system reset, the RTC registers are protected against parasitic write access with the
    DBP bit of the PWR power control register (PWR_CR). The DBP bit must be set to enable
    RTC registers write access.                                                                  */

  PWR->CR = PWR_CR_VOS_1 | PWR_CR_DBP; /*  Enable Backup Domain Access (leave VOS default)       */
  RCC->BDCR = (
    RCC_BDCR_LSEON                   | /*  LSE oscillator clock used as RTC clock                */
    RCC_BDCR_RTCSEL_0                | /*  LSE oscillator clock used as RTC clock                */
    RCC_BDCR_RTCEN                     /*  Enable RTC                                            */
  );

  // while (!(RCC->BDCR & RCC_BDCR_LSERDY)) { /*  */ }

  // RCC->BDCR = (
  //   RCC_BDCR_LSEON                   | /*  LSE oscillator clock used as RTC clock                */
  //   1 * RCC_BDCR_RTCSEL_0            | /*  LSE oscillator clock used as RTC clock                */
  //   1 * RCC_BDCR_RTCEN                 /*  Enable RTC                                            */
  // );

                                                                                                 /*
    After backup domain reset, all the RTC registers are write-protected. Writing to the RTC
    registers is enabled by writing a key into the Write Protection register, RTC_WPR.
    
    The following steps are required to unlock the write protection on all the RTC registers
    except for RTC_ISR[13:8], RTC_TAFCR, and RTC_BKPxR.

      1. Write ‘0xCA’ into the RTC_WPR register.
      2. Write ‘0x53’ into the RTC_WPR register.                                                 */

  RTC->WPR = 0xCA;
  RTC->WPR = 0x53;                                                                               /*

    To program the initial time and date calendar values, including the time format and the
    prescaler configuration, the following sequence is required:

      1. Set INIT bit to 1 in the RTC_ISR register to enter initialization mode. In this mode, 
         the calendar counter is stopped and its value can be updated.

      2. Poll INITF bit of in the RTC_ISR register. The initialization phase mode is entered 
         when INITF is set to 1. It takes from 1 to 2 RTCCLK clock cycles (due to clock
         synchronization).

      3. To generate a 1 Hz clock for the calendar counter, program first the synchronous
         prescaler factor in RTC_PRER register, and then program the asynchronous prescaler
         factor. Even if only one of the two fields needs to be changed, 2 separate write
         accesses must be performed to the RTC_PRER register.

      4. Load the initial time and date values in the shadow registers (RTC_TR and RTC_DR),
         and configure the time format (12 or 24 hours) through the FMT bit in the RTC_CR
         register.

      5. Exit the initialization mode by clearing the INIT bit. The actual calendar counter 
         value is then automatically loaded and the counting restarts after 4 RTCCLK clock 
         cycles.                                                                                 */

  RTC->ISR = ~RTC_ISR_WUTF;            /* clear WUTF flag, set INIT flag                         */
  while(!(RTC->ISR & RTC_ISR_INITF)) { /*  */ }

  RTC->PRER = UINT8_MAX;               /*  program first the synchronous prescaler factor        */
  RTC->PRER = (                        /*  then program the asynchronous prescaler factor        */
    RTC_PRER_PREDIV_A                | /*  0x007F0000                                            */
    UINT8_MAX                          /*  0x000000FF                                            */
  );
                                                                                               
  //                                                                                                
  // RTC->CALIBR = (                                                                                
  //   0 * RTC_CALIBR_DCS               | /*  0x00000080                                            */
  //   0 * RTC_CALIBR_DC                  /*  0x0000001F                                            */
  // );                                                                                             
  //                                                                                                
  // RTC->CALR = (                                                                                  
  //                                                                                                
  //   0 * RTC_CALR_CALP                | /*  0x00008000                                            */
  //   0 * RTC_CALR_CALW8               | /*    0x00004000                                          */
  //   0 * RTC_CALR_CALW16              | /*    0x00002000                                          */
  //                                                                                                
  //   0 * RTC_CALR_CALM                | /*  0x000001FF                                            */
  //   0 * RTC_CALR_CALM_0              | /*    0x00000001                                          */
  //   0 * RTC_CALR_CALM_1              | /*    0x00000002                                          */
  //   0 * RTC_CALR_CALM_2              | /*    0x00000004                                          */
  //   0 * RTC_CALR_CALM_3              | /*    0x00000008                                          */
  //   0 * RTC_CALR_CALM_4              | /*    0x00000010                                          */
  //   0 * RTC_CALR_CALM_5              | /*    0x00000020                                          */
  //   0 * RTC_CALR_CALM_6              | /*    0x00000040                                          */
  //   0 * RTC_CALR_CALM_7              | /*    0x00000080                                          */
  //   0 * RTC_CALR_CALM_8                /*    0x00000100                                          */
  // );

