danielac32/stm32/kernel (copia)/beremetal-core/include/main.h
  if (!(RTC->ISR & RTC_ISR_INITS)) {
    RTC->TR = 0x025034; 
    RTC->DR = 0x191124;
  }

  RTC->CR = 0;                                                                                   /*

          When the wakeup timer is disabled, wait for WUTWF=1 before enabling it again.          */

  while(!(RTC->ISR & RTC_ISR_WUTWF));
    
  RTC->WUTR = 2047;

  RTC->CR = (
    0 * RTC_CR_COE                   | /*  0x00800000                                            */
                                                                                                 
    0 * RTC_CR_OSEL                  | /*  0x00600000                                            */
    0 * RTC_CR_OSEL_0                | /*    0x00200000                                          */
    0 * RTC_CR_OSEL_1                | /*    0x00400000                                          */
                                                                                                 
    0 * RTC_CR_POL                   | /*  0x00100000                                            */
    1 * RTC_CR_COSEL                 | /*  0x00080000                                            */
    0 * RTC_CR_BKP                   | /*  0x00040000                                            */
    0 * RTC_CR_SUB1H                 | /*  0x00020000                                            */
    0 * RTC_CR_ADD1H                 | /*  0x00010000                                            */
    0 * RTC_CR_TSIE                  | /*  0x00008000                                            */
    0 * RTC_CR_WUTIE                 | /*  0x00004000                                            */
    0 * RTC_CR_ALRBIE                | /*  0x00002000                                            */
    0 * RTC_CR_ALRAIE                | /*  0x00001000                                            */
    0 * RTC_CR_TSE                   | /*  0x00000800                                            */
    1 * RTC_CR_WUTE                  | /*  0x00000400                                            */
    0 * RTC_CR_ALRBE                 | /*  0x00000200                                            */
    0 * RTC_CR_ALRAE                 | /*  0x00000100                                            */
    0 * RTC_CR_DCE                   | /*  0x00000080                                            */
    0 * RTC_CR_FMT                   | /*  0x00000040                                            */
    0 * RTC_CR_BYPSHAD               | /*  0x00000020                                            */
    0 * RTC_CR_REFCKON               | /*  0x00000010                                            */
    0 * RTC_CR_TSEDGE                | /*  0x00000008                                            */
                                                                                                 
    0 * RTC_CR_WUCKSEL               | /*  0x00000007                                            */
    0 * RTC_CR_WUCKSEL_0             | /*    0x00000001                                          */
    0 * RTC_CR_WUCKSEL_1             | /*    0x00000002                                          */
    0 * RTC_CR_WUCKSEL_2               /*    0x00000004                                          */
  );

  RTC->ISR = ~RTC_ISR_INIT;

  RTC->WPR = 0xFF;                     /* Enable RTC write protection                            */

  // while(!(RCC->BDCR & RCC_BDCR_LSERDY)) { /*  */ }

  // PWR->CR = PWR_CR_VOS_1;              /*  Disable Backup Domain Access                          */
  // RCC->APB1ENR = 0;                    /*  Disable PWR interface                                 */

  FLASH->ACR = (
    0 * FLASH_ACR_LATENCY_0WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_1WS        | /*                                                        */
    1 * FLASH_ACR_LATENCY_2WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_3WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_4WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_5WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_6WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_7WS        | /*                                                        */
    1 * FLASH_ACR_PRFTEN             | /*  0x00000100                                            */
    1 * FLASH_ACR_ICEN               | /*  0x00000200                                            */
    1 * FLASH_ACR_DCEN               | /*  0x00000400                                            */
    0 * FLASH_ACR_ICRST              | /*  0x00000800                                            */
    0 * FLASH_ACR_DCRST              | /*  0x00001000                                            */
    0 * FLASH_ACR_BYTE0_ADDRESS      | /*  0x40023C00                                            */
    0 * FLASH_ACR_BYTE2_ADDRESS        /*  0x40023C03                                            */
  );

  while(!(RCC->CR & RCC_CR_HSERDY))  { /*  Wait till HSE is ready */ }
  while(!(RCC->CR & RCC_CR_PLLRDY))  { /*  Wait till PLL is ready */ }

  RCC->CFGR = (
    0 * RCC_CFGR_SW                  | /*  0x00000003 SW[1:0] bits (System clock Switch)         */
    0 * RCC_CFGR_SW_0                | /*    0x00000001                                          */
    0 * RCC_CFGR_SW_1                | /*    0x00000002                                          */
    0 * RCC_CFGR_SW_HSI              | /*    HSI selected as system clock                        */
    0 * RCC_CFGR_SW_HSE              | /*    HSE selected as system clock                        */
    1 * RCC_CFGR_SW_PLL              | /*    PLL selected as system clock                        */

    0 * RCC_CFGR_SWS                 | /*  0x0000000C SWS[1:0] bits (System Clock Switch Status) */
    0 * RCC_CFGR_SWS_0               | /*    0x00000004                                          */
    0 * RCC_CFGR_SWS_1               | /*    0x00000008                                          */
    0 * RCC_CFGR_SWS_HSI             | /*    HSI oscillator used as system clock                 */
    0 * RCC_CFGR_SWS_HSE             | /*    HSE oscillator used as system clock                 */
    0 * RCC_CFGR_SWS_PLL             | /*    PLL used as system clock                            */
                                                                                                 /*
       HPRE: AHB prescaler
            Set and cleared by software to control AHB clock division factor.
            Caution: The clocks are divided with the new prescaler factor
            from 1 to 16 AHB cycles after HPRE write.

              0xxx: system clock not divided
              1000: system clock divided by 2
              1001: system clock divided by 4
              1010: system clock divided by 8
              1011: system clock divided by 16
              1100: system clock divided by 64
              1101: system clock divided by 128
              1110: system clock divided by 256
              1111: system clock divided by 512
       ================================================================================          */

    0 * RCC_CFGR_HPRE                | /*  0x000000F0 HPRE[3:0] bits (AHB prescaler)             */
    0 * RCC_CFGR_HPRE_0              | /*    0x00000010                                          */
    0 * RCC_CFGR_HPRE_1              | /*    0x00000020                                          */
    0 * RCC_CFGR_HPRE_2              | /*    0x00000040                                          */
    0 * RCC_CFGR_HPRE_3              | /*    0x00000080                                          */
    1 * RCC_CFGR_HPRE_DIV1           | /*    SYSCLK not divided                                  */
    0 * RCC_CFGR_HPRE_DIV2           | /*    SYSCLK divided by 2                                 */
    0 * RCC_CFGR_HPRE_DIV4           | /*    SYSCLK divided by 4                                 */
    0 * RCC_CFGR_HPRE_DIV8           | /*    SYSCLK divided by 8                                 */
    0 * RCC_CFGR_HPRE_DIV16          | /*    SYSCLK divided by 16                                */
    0 * RCC_CFGR_HPRE_DIV64          | /*    SYSCLK divided by 64                                */
    0 * RCC_CFGR_HPRE_DIV128         | /*    SYSCLK divided by 128                               */
    0 * RCC_CFGR_HPRE_DIV256         | /*    SYSCLK divided by 256                               */
    0 * RCC_CFGR_HPRE_DIV512         | /*    SYSCLK divided by 512                               */

